Revit 2027 API
ParameterTypeId.GroupnameParam Property
 "Group Name for Ribbon Combo Items (for Use with XAML)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GroupnameParam { get; }
Public Shared ReadOnly Property GroupnameParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GroupnameParam {
	ForgeTypeId^ get ();
}
static member GroupnameParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace